(function polyfill() {
  const relList = document.createElement("link").relList;
  if (relList && relList.supports && relList.supports("modulepreload")) {
    return;
  }
  for (const link of document.querySelectorAll('link[rel="modulepreload"]')) {
    processPreload(link);
  }
  new MutationObserver((mutations) => {
    for (const mutation of mutations) {
      if (mutation.type !== "childList") {
        continue;
      }
      for (const node of mutation.addedNodes) {
        if (node.tagName === "LINK" && node.rel === "modulepreload")
          processPreload(node);
      }
    }
  }).observe(document, { childList: true, subtree: true });
  function getFetchOpts(link) {
    const fetchOpts = {};
    if (link.integrity)
      fetchOpts.integrity = link.integrity;
    if (link.referrerPolicy)
      fetchOpts.referrerPolicy = link.referrerPolicy;
    if (link.crossOrigin === "use-credentials")
      fetchOpts.credentials = "include";
    else if (link.crossOrigin === "anonymous")
      fetchOpts.credentials = "omit";
    else
      fetchOpts.credentials = "same-origin";
    return fetchOpts;
  }
  function processPreload(link) {
    if (link.ep)
      return;
    link.ep = true;
    const fetchOpts = getFetchOpts(link);
    fetch(link.href, fetchOpts);
  }
})();
const style = "";
document.addEventListener("DOMContentLoaded", () => {
  const menuButton = document.querySelector("[data-menu-button]");
  const mobileMenu = document.getElementById("mobile-menu");
  const mobileMenuNav = document.querySelector(".mobile-menu__navigation");
  const buttonIcon = document.querySelector(".mobile-menu-btn__icon");
  const header = document.querySelector(".header");
  mobileMenu.style.transform = `translateY(${header.offsetHeight}px)`;
  mobileMenuNav.style.height = `calc(100vh - ${header.offsetHeight}px)`;
  mobileMenu.style.paddingBottom = `${header.offsetHeight}px`;
  menuButton.addEventListener("click", () => {
    const isOpen = menuButton.classList.toggle("is-open");
    mobileMenu.classList.toggle("is-open", isOpen);
    buttonIcon.classList.toggle("not-active", !isOpen);
    buttonIcon.classList.toggle("active", isOpen);
  });
  mobileMenu.addEventListener("click", (e) => {
    if (e.target === e.currentTarget) {
      const isOpen = menuButton.classList.toggle("is-open");
      mobileMenu.classList.toggle("is-open", isOpen);
      buttonIcon.classList.toggle("not-active", !isOpen);
      buttonIcon.classList.toggle("active", isOpen);
    }
  });
});
const products = [
  {
    id: "1",
    image: "/images/item-04.webp",
    title: "ELAM Чистий экстракт",
    volume: "100 Мл",
    paragraphs: [
      "<strong>Спазмолітичний крем</strong> ідеально підходить як додатковий потужний засіб для зменшення спастичних компонентів будь-якого походження, посттравматичних спазмів м’язів, спазмів, спричинених перенавантаженням; м’язових контрактур будь-якого походження в період реабілітації; периферійних спазмів гладеньких м’язів судин мікроциркуляторного русла центрального та периферійного походження під час лікування артеріальної гіпертензії; спастичної форми ДЦП у комплексному лікуванні та реабілітації; м’язових спастичних станів у спортсменів під час тренувального періоду; як масажний засіб у повсякденній роботі масажистів, реабілітологів,мануальних терапевтів.",
      "<strong>Дозування та спосіб застосування</strong>",
      "Спазмолітичний крем містить високотемпературний екстракт лікувального мулу, що містить велику кількість біологічно активних речовин, тому перед використанням обов’язкова проба на індивідуальну непереносимість! Для цього нанесіть невелику кількість крему на чисту шкіру зап’ястя. Якщо через 5 хвилин не з’явилися ознаки підвищеної чутливості, такі як почервоніння, свербіж, дискомфорт та інші, крем можна використовувати за призначенням.",
      " Для зменшення вираженого спазму великих скелетних м’язів крем наноситься масажними рухами на чисту шкіру. Кратність нанесення – 5-6 разів на добу. Оскільки спазмолітичний ефект виявляється майже відразу, тривалість застосування крему вирішується індивідуально.",
      "Під час використання крему у процесі реабілітації пацієнтів із м’язовими контрактурами, потрібно ретельно контролювати баланс м’язового напруження навколо суглобу. Для цього проводиться пальпація не тільки ураженої ділянки, але й інших м’язів, які залучені до підтримання м’язового балансу суглоба.",
      "Дозування при використанні спазмолітичного крему для зменшення спастичних компонентів при ДЦП залежить від вираженості м’язового напруження. Оптимально починати нанесення з 4 разів на добу на спазмовані ділянки, уважно спостерігаючи за динамікою зменшення спазму та підвищенням координації рухів. Тривалість використання має бути не меншою за 2 тижні з перервою на 7-10 днів для спостереження за збереженням ефекту після припинення використання. Подальша тривалість застосування цього крему підбирається реабілітологом індивідуально.",
      "При використанні спазмолітичного крему як масажного засобу, слід пам’ятати про швидке розслаблення спазмованих м’язів. Тому слід обмежити силу масажних рухів, щоб уникнути травмування м’язів.",
      "Для зменшення спастичного компоненту периферійних судин, крем наноситься 3-4 рази на добу протягом тижня. Підтримуюча доза складає 2 нанесення на добу протягом періоду лікування.",
      "<strong>Застереження</strong>",
      "Спазмолітичний крем містить мінімальну кількість консервантів та штучних домішок, тому краще зберігати крем в холодильнику або в темному прохолодному місці. Термін придатності спазмолітичного крему у холодильнику не повинен перевищувати 12 місяців. Якщо крем знаходиться в теплому місці, рекомендовано використовувати його не пізніше 6 місяців з моменту виробництва. При сильному нагріванні кремова емульсія може бути нестабільною та розшаруватись, проте терапевтичні властивості при цьому не зменшуються. Крем містить понад 80% чистого високотемпературного екстракту лікувального мулу, який має специфічний запах, нагадуючи запах мулу, горілої трави та водоростей. Це повністю нормально та пов’язано з використанням натуральної сировини."
    ],
    price: "450"
  },
  {
    id: "2",
    image: "/public/images/item-01.webp",
    title: "ELAM від болю в суглобах",
    volume: "50 Мл",
    paragraphs: [
      "<strong>Повний екстракт лиманного мулу </strong> виробляється за патентом України «Спосіб виготовлення повної витяжки з лікувального мулу солоних озер та лиманів» № 77136 від 25.01.2013. Екстракт представляє собою продукт високотемпературної екстракції від 100 до 450 С0, при якій виділяється суміш кількох компонентів. Перший компонент – це паровий екстракт, що отриманий при температурі 100 С0. За складом це аналог препарату ФіБС, який був розроблений у минулому сторіччі акад. В.П. Філатовим. Він містить карбонові кислоти, амінокислоти, мінеральні речовини, кумаріни та ін. Це майже прозора рідина з характерним запахом. Після відгону рідкої фази лікувального мулу, температура у ємності починає підійматися до 120-180 С0. Для захисту компонентів лікувального мулу від окислення протягом подальшого нагрівання відбувається заміна атмосфери на інертну шляхом продувки ємності перегрітим азотом підвищеної чистоти. При цьому виділяється кристалічна вода в якій розчиняються високомолекулярні компоненти лікувального мулу. Ця жовтувата рідина має виражений запах лікувального мулу з нотами тютюну. Надалі мулова сировина нагрівається до 450 С0. Протягом цього циклу виділяється компоненти найвищої молекулярної маси. Це органічні смоли, які виходять у вигляді перегрітого диму що осідають та розчиняються в отриманому раніше екстракті при його барботажі. Цей компонент надає більш жовтого кольору екстракту, має специфічний запах горілої трави та тютюну. Готовий повний екстракт лиманного мулу представляє собою жовтувату рідину, що опалескує зі специфічним запахом.",
      "Повний екстракт лиманного мулу містить всі компоненти, що екстрагувалися протягом цього циклу та має виражені стимуляційні, регенераторні та загоюючі ефекти. Використання повного екстракту лиманного мулу має кілька напрямків. Ми на його основі виробляємо спазмолітичні та протизапальні креми, засоби для догляду за шкірою, порожниною рота та ін. У зв’язку з тим, що екстракт має вкрай виражену спазмолітичну дію, він використовується у косметології для зменшення спазму м’язів обличчя та зменшення мімічних зморшок. Крім того виражені стимулюючі та антисептичні властивості сприяють зменшенню запалень, а також борються з акне. Саме тому повний екстракт лиманного мулу використовують як домішок у засоби для вмивання та креми для догляду за шкірою. Для цього невелику кількість екстракту додають до відповідного засобу при щоденному використанні.",
      "<strong>Для догляду за дефектами шкіри</strong>, язвами, що повільно загоюються та іншими захворюваннями шкіри екстракт використовують як засіб для промивання та компресів. Стимуляційні властивості сприяють інтенсивному загоєнню. При цьому екстракт можна використовувати як у чистому вигляді так і у складі інших компонентів догляду за ранами.",
      "<strong>При гострому отиті </strong>екстракт використовується у вигляді крапель. Перед закапуванням слід підігріти екстракт до температури тіла і у кількості по 2-3 краплі застосовувати у кожне вухо. Увага! Екстракт не стерильний, тому не використовується у разі перфорації барабанної перетинки.",
      "<strong>При захворюваннях очей </strong>екстракт використовується для регулярного промивання, помітно полегшуючи дискомфорт, біль та зменшуючи виділення з очей.",
      "Для загальностимулюючого ефекту екстракт використовується як домішок до раціону харчування. При цьому дозування підбирається індивідуально. За нашими спостереженнями оптимальний стимулюючий ефект проявляється при двократному прийомі чайної ложки чистого екстракту на добу. Перед прийомом екстракт бажано розвести в 100 мл теплої води та приймати натще вранці та перед сном.",
      "<strong>Для зменшення проявів запалення шлунку</strong> екстракт приймають 3-4 рази на добу по 3-5 мл за 20 хвилин до їди, бажано попередньо розвести в 50 мл теплої води. При цьому поліпшення стану спостерігається протягом перших днів. Для стабілізації та закріплення ефекту приймання екстракту варто проводити протягом 3 тижнів з періодичністю 4-5 разів на рік.",
      "Для догляду за волоссям та шкірою голови екстракт додають до нейтрального засобу для миття або маски для волосся. При регулярному використанні пацієнти відмічають зникнення лупи та поліпшення густоти та стану волосся.",
      "Від кровоточивості ясен повний екстракт лиманного мулу використовується у вигляді ополіскувача. Для цього 5 мл екстракту розводять у невеликій кількості теплої води. Розбавленим екстрактом ополіскують порожнину рота протягом 1-2 хвилин після чищення зубів. В де-яких випадках при пародонтозі проводять аплікацію чистого екстракту на уражені ділянки ясен.",
      "Для створення розслаблюючих ванн екстракт додається у кількості 50 мл у воду теплу Важливо! не гарячу воду. Тривалість перших процедур варто обмежувати 15 хвилинами для уникнення раптового падіння артеріального тиску завдяки вираженій міорелаксації.",
      "<strong>Пам’ятайте! </strong>Перед застосуванням будь-яких засобів для лікування або зменшення болю в, важливо проконсультуватися з лікарем або фахівцем з медичних питань, особливо якщо у вас є які-небудь попередні медичні становища або алергічні реакції на складові крему.",
      "УВАГА! Перед використанням повного екстракту лікувального мулу ОБОВ’ЯЗКОВО проведіть тест на індивідуальну непереносимість. Це пов’язано з тим, що складові екстракту мають біологічне походження та можуть викликати непередбачувані індивідуальні реакції організму. Екстракт має величезний стимулюючий та регенеруючий потенціал, тому не відповідальне його використання може призвести до змін артеріального тиску, безсоння, шкірних та інших реакцій, що не описані в цій інструкції."
    ],
    price: "350"
  },
  {
    id: "3",
    image: "/public/images/item-03.webp",
    title: "ELAM від м'язових спазмів",
    volume: "100 Мл",
    paragraphs: [
      "<strong>Спазмолітичний крем</strong> ідеально підходить як додатковий потужний засіб для зменшення спастичних компонентів будь-якого походження, посттравматичних спазмів м’язів, спазмів, спричинених перенавантаженням; м’язових контрактур будь-якого походження в період реабілітації; периферійних спазмів гладеньких м’язів судин мікроциркуляторного русла центрального та периферійного походження під час лікування артеріальної гіпертензії; спастичної форми ДЦП у комплексному лікуванні та реабілітації; м’язових спастичних станів у спортсменів під час тренувального періоду; як масажний засіб у повсякденній роботі масажистів, реабілітологів, мануальних терапевтів.",
      "<strong>Дозування та спосіб застосування</strong>",
      "Спазмолітичний крем містить високотемпературний екстракт лікувального мулу, що містить велику кількість біологічно активних речовин, тому перед використанням обов’язкова проба на індивідуальну непереносимість! Для цього нанесіть невелику кількість крему на чисту шкіру зап’ястя. Якщо через 5 хвилин не з’явилися ознаки підвищеної чутливості, такі як почервоніння, свербіж, дискомфорт та інші, крем можна використовувати за призначенням.",
      "Для зменшення вираженого спазму великих скелетних м’язів крем наноситься масажними рухами на чисту шкіру. Кратність нанесення – 5-6 разів на добу. Оскільки спазмолітичний ефект виявляється майже відразу, тривалість застосування крему вирішується індивідуально.",
      "Під час використання крему у процесі реабілітації пацієнтів із м’язовими контрактурами, потрібно ретельно контролювати баланс м’язового напруження навколо суглобу. Для цього проводиться пальпація не тільки ураженої ділянки, але й інших м’язів, які залучені до підтримання м’язового балансу суглоба.",
      "Дозування при використанні спазмолітичного крему для зменшення спастичних компонентів при ДЦП залежить від вираженості м’язового напруження. Оптимально починати нанесення з 4 разів на добу на спазмовані ділянки, уважно спостерігаючи за динамікою зменшення спазму та підвищенням координації рухів. Тривалість використання має бути не меншою за 2 тижні з перервою на 7-10 днів для спостереження за збереженням ефекту після припинення використання. Подальша тривалість застосування цього крему підбирається реабілітологом індивідуально.",
      "При використанні спазмолітичного крему як масажного засобу, слід пам’ятати про швидке розслаблення спазмованих м’язів. Тому слід обмежити силу масажних рухів, щоб уникнути травмування м’язів.",
      "Для зменшення спастичного компоненту периферійних судин, крем наноситься 3-4 рази на добу протягом тижня. Підтримуюча доза складає 2 нанесення на добу протягом періоду лікування.",
      "<strong>Застереження</strong>",
      "Спазмолітичний крем містить мінімальну кількість консервантів та штучних домішок, тому краще зберігати крем в холодильнику або в темному прохолодному місці. Термін придатності спазмолітичного крему у холодильнику не повинен перевищувати 12 місяців. Якщо крем знаходиться в теплому місці, рекомендовано використовувати його не пізніше 6 місяців з моменту виробництва. При сильному нагріванні кремова емульсія може бути нестабільною та розшаруватись, проте терапевтичні властивості при цьому не зменшуються. Крем містить понад 80% чистого високотемпературного екстракту лікувального мулу, який має специфічний запах, нагадуючи запах мулу, горілої трави та водоростей. Це повністю нормально та пов’язано з використанням натуральної сировини."
    ],
    price: "400"
  },
  {
    id: "4",
    image: "/public/images/item-02.webp",
    title: "ELAM від рубців",
    volume: "30 Мл",
    paragraphs: [
      "Цей крем був створений під час облоги Чернігова у 2022р. Він мав діяти швидко, інтенсивно, наноситися не частіше 2 разів на добу та не мати вираженого аромату, бо в укриттях зі скупченням людей додаткові запахи були зайві. Ми скомбінували стимулюючу та спазмолітичну дію високотемпературного екстракту лікувального мулу, протизапальну дію діклофенаку натрію та знеболюючу та стимулюючу дію ментолу та капсаіцину, отримавши чудовий продукт.",
      "Основна мета використання крему від болю в суглобах – максимально ефективно зменшити м’язовий та судинний спазм, запалення, зробити більш активним кровообіг в ураженій ділянці та зменшити набряк. Для цього в рецептурі ми використовуємо кілька діючих елементів: Повний екстракт лікувального мулу забезпечує виражений спазмолітичний та знеболювальний ефект, комбінація капсаїцину та ментолу має виражену відволікаючу дію та дозволяє активувати кровообіг. Диклофенак натрію є потужним інгібітором ферменту, що стимулює розвиток запалення та створює умови для формування болю, набряку та спазму м’язових структур навколо ураженої ділянки. Додаткову активацію протизапальних компонентів та їх глибоке проникнення в джерело запалення забезпечує диметил сульфоксид.",
      "За нашими спостереженнями при використанні цього крему відбувається швидкий зігрівальний ефект з вираженим відчуттям холоду, що викликане наявністю капсаіцину та ментолу у складі. Потягом перших хвилин підвищується поверхневий кровообіг, підвищується температура в області нанесення крему. Протягом наступних 20-30 хвилин відбувається вбирання спазмолітичних та протизапальних компонентів, які поступово знижують прояви запалення та зменшують больові відчуття. Максимальний ефект спостерігається протягом трьох-п’яти годин після нанесення крему. Повторне нанесення крему від болю в суглобах варто проводити не раніше за 6 годин після першого використання. Для максимального ефекту варто місце нанесення крему захистити харчовою плівкою та накрити щільною, бажано вовняною тканиною. У разі появлення відчуття сильного печіння по-перше зніміть тканину та плівку, якщо відчуття печіння триває з високою інтенсивністю, змийте крем від болю в суглобах теплою водою з милом, просушіть та накрийте тканиною. Повторне нанесення крему від болю в суглобах варто проводити за 2-3 години, змішавши його з будь-яким нейтральним кремом для тіла у пропорції 1:1. Ефект крему від болю в суглобах збільшується протягом перших трьох днів. Більше п’яти днів поспіль використання крему від болю в суглобах не викличе більшого ефекту. Якщо біль не зменшився, його причиною може бути травма, що триває (перелам, вивих суглобу, розтягнення чи розрив зв’язок чи сухожилків та ін.). У такому разі варто терміново звернутися за допомогою до лікаря.",
      "<strong>Важливо! Крем містить біологічні похідні, тому важливо провести тест на індивідуальну непереносимість, нанесенням невеликої кількості крему від болю в суглобах на ліктьовий згин. Крем від болю в суглобах містить капсаїцин рослинного походження, тому після використання обов’язково потрібно вимити руки теплою водою з милом.</strong>"
    ],
    price: "350"
  },
  {
    id: "5",
    image: "/public/images/item-05.webp",
    title: "ELAM від болю в суглобах",
    volume: "30 Мл",
    paragraphs: [
      "Цей крем був створений під час облоги Чернігова у 2022р. Він мав діяти швидко, інтенсивно, наноситися не частіше 2 разів на добу та не мати вираженого аромату, бо в укриттях зі скупченням людей додаткові запахи були зайві. Ми скомбінували стимулюючу та спазмолітичну дію високотемпературного екстракту лікувального мулу, протизапальну дію діклофенаку натрію та знеболюючу та стимулюючу дію ментолу та капсаіцину, отримавши чудовий продукт."
    ],
    price: "300"
  }
];
const productList = document.getElementById("product-list");
const cards = products.map(
  ({ id, image, title, volume, price }) => `
  <li class="production__item" onclick="openProductCardModal(); renderCardById(${id})">
                  <div id="${id}" class="product-card">
                    <div class="product-card__image">
                        <img
                          src=${image}
                          alt=${title}                        
                          loading="lazy"
                          data-lazy="true"
                        />
                    </div>
                    <h3 class="product-card__title">
                    ${title}
                      <span>(${volume})</span>
                    </h3>
                   <p class="product-card__info-more">
                      Докладніше...
                      <span><i class="fa-solid fa-plus"></i></span>
                    </p>
                    <button class="main-button main-button--product-card">
                      <i class="fa-solid fa-cart-arrow-down"></i>
                      <p>
                        <span class="product-card__button-price">Ціна:</span>
                        ${price} грн.
                      </p>
                    </button>
                  </div>
                </li>
  `
).join("");
productList.innerHTML = cards;
const productCardModalOverlay = document.getElementById("production-modal");
const productCardModalContent = document.getElementById(
  "production-modal-content"
);
const productCards = document.querySelectorAll(".product-card");
const renderCardById = (cardId) => {
  const { image, paragraphs, price, title, volume } = products.find(
    (product) => product.id === `${cardId}`
  );
  productCardModalContent.innerHTML = `
  <div class="production__modal-image-box">
    <img
      src=${image}
      alt=${title}
      loading="lazy"
      data-lazy="true"
    />
    <h3 class="production__modal-title">
      ${title}
      <span>(${volume})</span>
    </h3>
    <button class="main-button main-button--modal-product-card">
      <i class="fa-solid fa-cart-arrow-down"></i>
      <p>
        <span class="product-card__button-price">Ціна:</span>
        ${price} грн.
      </p>
    </button>
  </div>
  <div class="production__modal-description-box">
    ${paragraphs.map((paragraph) => `<p class="production__modal-text>${paragraph}</p>`).join("")}
    <p
      class="production__modal-info-less"
      onclick="closeProductCardModal()"
    >
      Назад... <span><i class="fa-solid fa-minus"></i></span>
    </p>
  </div>`;
};
const openProductCardModal = () => {
  productCardModalOverlay.style.display = "block";
  productCardModalContent.scrollTop = 0;
};
const closeProductCardModal = () => {
  productCardModalContent.innerHTML = "";
  productCardModalOverlay.style.display = "none";
};
productCards.forEach((productCard) => {
  productCard.addEventListener("click", () => {
  });
});
productCardModalOverlay.addEventListener("click", (e) => {
  e.target === e.currentTarget && closeProductCardModal();
});
window.openProductCardModal = openProductCardModal;
window.closeProductCardModal = closeProductCardModal;
window.renderCardById = renderCardById;
(function() {
  const fonts = ["cursive"];
  let captchaValue = "";
  function genCaptcha() {
    let value = btoa(Math.random() * 1e9);
    value = value.substr(0, 5 + Math.random() * 5);
    captchaValue = value;
  }
  function setCaptcha() {
    let html = captchaValue.split("").map((char) => {
      const rotate = -20 + Math.random() * 30;
      const font = Math.trunc(Math.random() * fonts.length);
      return `<span
            style="
            transform:rotate(${rotate}deg);
            font-family:${font[font]};
            "
           >${char} </span>`;
    }).join("");
    document.querySelector(".form__preview").innerHTML = html;
  }
  function initCaptcha() {
    document.querySelector(".form__captcha--refresh").addEventListener("click", function(e) {
      e.preventDefault();
      genCaptcha();
      setCaptcha();
    });
    genCaptcha();
    setCaptcha();
  }
  initCaptcha();
  document.querySelector(".main-button--form").addEventListener("click", function(e) {
    e.preventDefault();
    let inputcaptchavalue = document.querySelector(
      ".form__input--captcha"
    ).value;
    if (inputcaptchavalue === captchaValue) {
      alert("Ok");
    } else {
      alert("Invalid Captcha");
    }
  });
})();
const modal = document.getElementById("galleryModal");
const images = document.querySelectorAll(".gallery__image");
const slides = document.getElementsByClassName("gallery__modal-slide");
const dots = document.getElementsByClassName("gallery__modal-image-demo");
const captionText = document.getElementById("caption");
let slideIndex = 1;
function openModal() {
  modal.style.display = "block";
}
function closeModal() {
  modal.style.display = "none";
}
showSlides(slideIndex);
function plusSlides(n) {
  showSlides(slideIndex += n);
}
function currentSlide(n) {
  showSlides(slideIndex = n);
}
function showSlides(n) {
  let i;
  if (n > slides.length) {
    slideIndex = 1;
  }
  if (n < 1) {
    slideIndex = slides.length;
  }
  for (i = 0; i < slides.length; i++) {
    slides[i].style.display = "none";
  }
  for (i = 0; i < dots.length; i++) {
    dots[i].className = dots[i].className.replace(" active", "");
  }
  slides[slideIndex - 1].style.display = "block";
  dots[slideIndex - 1].className += " active";
  captionText.innerHTML = dots[slideIndex - 1].alt;
}
modal.addEventListener("click", (e) => {
  if (e.target === e.currentTarget) {
    closeModal();
  }
});
window.openModal = openModal;
window.closeModal = closeModal;
window.currentSlide = currentSlide;
window.plusSlides = plusSlides;
images.forEach((img, index) => {
  img.addEventListener("click", () => {
    openModal();
    currentSlide(index + 1);
  });
});
let lastScrollY = window.scrollY;
window.addEventListener("scroll", () => {
  const header = document.querySelector(".header");
  const currentScrollY = window.scrollY;
  if (currentScrollY > lastScrollY) {
    header.classList.add("hidden");
  } else {
    header.classList.remove("hidden");
  }
  lastScrollY = currentScrollY;
});
console.log("Hello. If you see this string - code is normal");
